en/micro-integrator/docs/use-cases/examples/sequence_examples/custom-sequences-with-proxy-services.md

# Custom Sequences with Proxy Services
## Example use case

## Synapse configuration

This configuration creates two Proxy Services. The first Proxy Service "StockQuoteProxy1" uses the sequence named "proxy_1" to process incoming messages and the sequence named "out" to process outgoing responses. The second Proxy Service "StockQuoteProxy2" is set to directly forward messages that are received to the endpoint named "proxy_2_endpoint" without any mediation.

```xml tab='Endpoint'
<endpoint xmlns="http://ws.apache.org/ns/synapse" name="proxy_2_endpoint">
    <address uri="http://localhost:9000/services/SimpleStockQuoteService"/>
</endpoint>
```

```xml tab='Local Entry'
<localEntry xmlns="http://ws.apache.org/ns/synapse" key="proxy_wsdl" src="file:samples/wsdl/sample_proxy_1.wsdl"/>
```

```xml tab='Sequence'
<sequence xmlns="http://ws.apache.org/ns/synapse" name="proxy_1">
    <send>
        <endpoint><address uri="http://localhost:9000/services/SimpleStockQuoteService"/></endpoint>
    </send>
</sequence>
```

```xml tab='Out Sequence'
<sequence xmlns="http://ws.apache.org/ns/synapse" name="out">
    <send/>
</sequence>
```

```xml tab='Proxy Service 1'
<proxy xmlns="http://ws.apache.org/ns/synapse" name="StockQuoteProxy1">
    <publishWSDL key="proxy_wsdl"/>
    <target inSequence="proxy_1" outSequence="out"/>
</proxy>
```

```xml tab='Proxy Service 2'
<proxy xmlns="http://ws.apache.org/ns/synapse" name="StockQuoteProxy2">
    <publishWSDL key="proxy_wsdl"/>
    <target endpoint="proxy_2_endpoint" outSequence="out"/>
</proxy>
```
## Build and run

Create the artifacts:

1. Set up WSO2 Integration Studio.
2. Create an ESB Config project
3. Create integration artifacts with the above configuration.
4. Deploy the artifacts in your Micro Integrator.
5. Create $MI_HOME/samples/wsdl folder and copy sample_proxy_1.wsdl to that folder

Set up the back-end service:

........

Invoke the Micro Integrator:

You could send a stock quote request to each of these Proxy Services and receive the reply generated by the actual service hosted on the Axis2 instance.

Request to StockQuoteProxy1
```bash
POST http://localhost:8290/services/StockQuoteProxy1.StockQuoteProxy1HttpSoap11Endpoint HTTP/1.1
Accept-Encoding: gzip,deflate
Content-Type: text/xml;charset=UTF-8
SOAPAction: "urn:getQuote"
Content-Length: 416
Host: Chanikas-MacBook-Pro.local:8290
Connection: Keep-Alive
User-Agent: Apache-HttpClient/4.1.1 (java 1.5)

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:ser="http://services.samples" xmlns:xsd="http://services.samples/xsd">
   <soapenv:Header/>
   <soapenv:Body>
      <ser:getQuote>
         <ser:request>
            <xsd:symbol>IBM</xsd:symbol>
         </ser:request>
      </ser:getQuote>
   </soapenv:Body>
</soapenv:Envelope>
```

Request to StockQuoteProxy2
```bash
POST http://localhost:8290/services/StockQuoteProxy2.StockQuoteProxy2HttpSoap11Endpoint HTTP/1.1
Accept-Encoding: gzip,deflate
Content-Type: text/xml;charset=UTF-8
SOAPAction: "urn:getQuote"
Content-Length: 416
Host: Chanikas-MacBook-Pro.local:8290
Connection: Keep-Alive
User-Agent: Apache-HttpClient/4.1.1 (java 1.5)

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:ser="http://services.samples" xmlns:xsd="http://services.samples/xsd">
  <soapenv:Header/>
  <soapenv:Body>
     <ser:getQuote>
        <ser:request>
           <xsd:symbol>IBM</xsd:symbol>
        </ser:request>
     </ser:getQuote>
  </soapenv:Body>
</soapenv:Envelope>
```